**Pandas**

Pandas is a fast poweful flexible and easy to use open source data analysis and manipulation tool, buit on top of the python programming language

Pandas is an essential, open-source Python library for data manipulation, analysis, and cleaning. It provides powerful and flexible data structures designed to make working with "relational" or "labeled" data, such as data found in spreadsheets or SQL tables, easy and intuitive.

In [2]:
import pandas as pd
import numpy as np

In [3]:
## Creating series
# 1. using list
# 2. using dict
countries = ['India' , 'USA' , 'France' , 'Argentina' , 'Brazil']
countries_series = pd.Series(countries)
print(countries_series)


students = ['Shravan' ,'Akshay' , 'Ayush' , 'Sahil']
student_series = pd.Series(students , index = ['a' , 'b' , 'c' , 'd'] , name = 'student_details')
print(student_series)

0        India
1          USA
2       France
3    Argentina
4       Brazil
dtype: object
a    Shravan
b     Akshay
c      Ayush
d      Sahil
Name: student_details, dtype: object

In [4]:
marks = {
    'maths' : 20,
    'science':15,
    'hindi':19,
    'english':17
}

marks_series = pd.Series(marks , name = 'marks_details')
print(marks_series)

maths      20
science    15
hindi      19
english    17
Name: marks_details, dtype: int64

**Series Attributes**

1.size
2.is_unique
3.name
4.index
5.values
6.dtype

In [5]:
## 1. size
print(marks_series.size)
print(countries_series.size)

4
5

In [6]:
## 2. is_unique
nums_series = pd.Series([1,2,3,4,4,5,8,9])
print(nums_series.is_unique)

False

In [7]:
## 3. name
marks_series.name

'marks_details'

In [8]:
## 4. index
countries_series.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
## 5. values
countries_series.values

array(['India', 'USA', 'France', 'Argentina', 'Brazil'], dtype=object)

**Read csv using pandas**

**Different ways to convert the dataframe into series**

1. df['column_name']
convert a specific column to a series

2. df.set_index('index')['value']
For setting one column as index and other as value

3. df.squeeze()
If when there is only one column in the dataset

4. df.stack()
Used for flattening data eg: (5,5) -> 25

5. df.iloc[:,n]
  : means all rows and n means one specific col

In [10]:
sports_data = pd.read_csv('sports_practice.csv')
sports_data

              player       sport team_or_country  age  career_goals_or_runs
0       Lionel Messi    Football             PSG   36                   750
1  Cristiano Ronaldo    Football        Al-Nassr   38                   820
2        Virat Kohli     Cricket           India   34                 12040
3       LeBron James  Basketball          Lakers   37                 35000
4      Roger Federer      Tennis     Switzerland   41                   130
5    Serena Williams      Tennis             USA   40                    73
6   Sachin Tendulkar     Cricket           India   48                 34357
7       Kevin Durant  Basketball   Brooklyn Nets   34                 26000
8     Novak Djokovic      Tennis          Serbia   36                   102
9        Kobe Bryant  Basketball          Lakers   41                 33643

In [11]:
##  df['col_name']
player = sports_data['player']
sport = sports_data['sport']
team_country = sports_data['team_or_country']
player_age = sports_data['age']
career = sports_data['career_goals_or_runs']

In [12]:
print(type(player))
player
sport
team_country
player_age
career

<class 'pandas.core.series.Series'>

0      750
1      820
2    12040
3    35000
4      130
5       73
6    34357
7    26000
8      102
9    33643
Name: career_goals_or_runs, dtype: int64

In [13]:
movies_data = pd.read_csv('bollywood.csv')
movies_data

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [14]:
## df.set_index('index')['value']
movies_data = movies_data.set_index('movie')['lead']

In [15]:
print(type(movies_data))
movies_data

<class 'pandas.core.series.Series'>

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [16]:
subs_data = pd.read_csv('subs.csv')
subs_data

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [17]:
## df.squeeze()
subs_data = subs_data.squeeze()
subs_data

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [18]:
sample_data = pd.read_csv('sample.csv')
print(sample_data.shape)
sample_data

(5, 5)

   id    name  age department  salary
0   1    Amit   24         IT   45000
1   2    Neha   27         HR   38000
2   3   Rahul   30    Finance   52000
3   4   Priya   22  Marketing   34000
4   5  Suresh   35         IT   60000

In [19]:
## df.stack()
sample_data = sample_data.stack()
print(sample_data)

0  id                    1
   name               Amit
   age                  24
   department           IT
   salary            45000
1  id                    2
   name               Neha
   age                  27
   department           HR
   salary            38000
2  id                    3
   name              Rahul
   age                  30
   department      Finance
   salary            52000
3  id                    4
   name              Priya
   age                  22
   department    Marketing
   salary            34000
4  id                    5
   name             Suresh
   age                  35
   department           IT
   salary            60000
dtype: object

In [20]:
daily_steps = pd.read_csv('daily_steps.csv')
print(type(daily_steps))

<class 'pandas.core.frame.DataFrame'>

In [21]:
daily_steps = daily_steps.iloc[:,0]

In [22]:
print(daily_steps)
print(type(daily_steps))

0     7500
1     9000
2     5000
3     6000
4     7500
5    10000
6     5000
7     9000
8     5000
9     5000
Name: Daily_Steps, dtype: int64
<class 'pandas.core.series.Series'>

**series methods**

In [23]:
## head()  -> This function returns the first n rows for the object based on position
movies_data.head()

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
Name: lead, dtype: object

In [24]:
## tail() -> This function returns the last n rows for the object based on position
movies_data.tail()

movie
Hum Tumhare Hain Sanam      Shah Rukh Khan
Aankhen (2002 film)       Amitabh Bachchan
Saathiya (film)               Vivek Oberoi
Company (film)                  Ajay Devgn
Awara Paagal Deewana          Akshay Kumar
Name: lead, dtype: object

In [25]:
## sample()
movies_data.sample(10)

movie
Firaaq                                                   Inaamulhaq
Fareb (2005 film)                              Shilpa Shetty Kundra
Aankhen (2002 film)                                Amitabh Bachchan
Khwahish                                             Himanshu Malik
Filmistaan                                            Sharib Hashmi
Main Hoon Na                                         Shah Rukh Khan
Bas Ek Pal                                              Juhi Chawla
Aladin (film)                                      Amitabh Bachchan
Mickey Virus                                            Manish Paul
Hind Ka Napak Ko Jawab: MSG Lion Heart 2    Gurmeet Ram Rahim Singh
Name: lead, dtype: object

In [26]:
## value_counts -> frequency of each item in the dataset
movies_data.value_counts(ascending = False)

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [27]:
## sort_values -> sort the data with values
movies_data.sort_values(ascending = True) # sorts in ascending order

movie
Qaidi Band                            Aadar Jain
Roar: Tigers of the Sundarbans      Aadil Chahal
Lipstick Under My Burkha            Aahana Kumra
Raat Gayi Baat Gayi?                Aamir Bashir
Talaash: The Answer Lies Within       Aamir Khan
                                        ...
Dil Toh Deewana Hai                  Zeenat Aman
Sallu Ki Shaadi                      Zeenat Aman
Strings of Passion                   Zeenat Aman
Dunno Y... Na Jaane Kyon             Zeenat Aman
Taj Mahal: An Eternal Love Story     Zulfi Sayed
Name: lead, Length: 1500, dtype: object

In [28]:
## sort_index
movies_data.sort_index(ascending = True)

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object

In [29]:
# inplace parameter
# The inplace parameter in pandas determines whether an operation
# modifies the original DataFrame or Series directly (when True) or returns
#  a new object with the modifications while leaving the original untouched (when False, the default).

marks_series.sort_values(ascending = False,inplace = True) # sorting in descending , and permanent change to the series
marks_series

maths      20
hindi      19
english    17
science    15
Name: marks_details, dtype: int64

**Series Maths methods**

In [30]:
## 1. count() -> gives count of items excluding null values
cars_series = pd.Series(['Audi' , 'BMW' , 'Ferrari' , 'Scorpio' , np.nan])
print(cars_series.size)
print(cars_series.count()) # does not count the null values

5
4

In [31]:
## 2. sum()
print(daily_steps.sum())

69000

In [32]:
## 3. product()
series_num = pd.Series([1,2,3,4,5,6])
print(series_num.product())

720

In [33]:
## 4. mean , meadian, mode , std , var
print(marks_series)
print(marks_series.mean())
print(marks_series.median())
print(marks_series.mode()) # most frequently occuring value or item
print(marks_series.std())
print(marks_series.var())

maths      20
hindi      19
english    17
science    15
Name: marks_details, dtype: int64
17.75
18.0
0    15
1    17
2    19
3    20
Name: marks_details, dtype: int64
2.217355782608345
4.916666666666667

In [34]:
## describe()
marks_series.describe()

count     4.000000
mean     17.750000
std       2.217356
min      15.000000
25%      16.500000
50%      18.000000
75%      19.250000
max      20.000000
Name: marks_details, dtype: float64

In [35]:
## max() and min()
print(marks_series.max())
print(marks_series.min())

20
15

**Slicing Indexing on pandas series**

There are two ways to access data
1. iloc(integer location based indexing)
2. loc(location based indexing)

In [36]:
s = pd.Series([10,20,30,40,50,60] , index = ['a','b','c','d','e','f'])
print(s)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [37]:
## accessing values using iloc
print(s.iloc[1]) #20
print(s.iloc[-1]) # 60

## accessing values using loc
print(s.loc['d'])

20
60
40

In [38]:
## Negative indexing does not work in loc
random_series = pd.Series([1,2,3,4,5], index = [1,2,3,4,5])
print(random_series)

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [39]:
print(random_series.loc[5])

5

In [40]:
import pandas as pd
import numpy as np

# Series 1: Integer index labels
s1 = pd.Series([100, 200, 300, 400, 500], index=[5, 3, 1, 8, 2])

# Series 2: String index labels
s2 = pd.Series([10, 20, 30, 40, 50], index=['b', 'd', 'a', 'e', 'c'])

# Series 3: Non-sequential integer labels
s3 = pd.Series(['A', 'B', 'C', 'D', 'E'], index=[10, 20, 30, 40, 50])

# Series 4: Mixed type index (for advanced confusion)
s4 = pd.Series([1.1, 2.2, 3.3, 4.4], index=[0, '1', 2, '3'])

In [41]:
# What does this return?
result = s1.iloc[2]
print(result)
# A) 300  B) 200  C) Error  D) 100

# What does this return?
result = s1.loc[2]
print(result)
# A) 500  B) 300  C) Error  D) 200

# What does this return?
result = s1.loc[1]
print(result)
# A) 300  B) 200  C) 100  D) Error

# What does this return?
result = s2.loc['a':'c']
print(result)
# A) ['a', 'b', 'c'] values  B) [30, 10, 50]  C) Error  D) [30, 50]

# What does this return?
result = s2.iloc[1:3]
print(result)
# A) ['d', 'a']  B) [20, 30]  C) ['a', 'e']  D) Error

300
500
300
a    30
e    40
c    50
dtype: int64
d    20
a    30
dtype: int64

In [42]:
## Indexing on datasets
print(movies_data.iloc[0]) # fetching first value
print(movies_data.loc['Uri: The Surgical Strike']) # similar using loc

Vicky Kaushal
Vicky Kaushal

In [43]:
## slicing on datasets
print(movies_data.iloc[0:5])

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
Name: lead, dtype: object

In [44]:
print(movies_data.loc['Uri: The Surgical Strike' : 'Evening Shadows'])

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
Name: lead, dtype: object

**Working with fancy indexing**

In [45]:
print('Fancy Indexing')
player.iloc[[0,1]] # ronaldo and messi

Fancy Indexing

0         Lionel Messi
1    Cristiano Ronaldo
Name: player, dtype: object

In [46]:
## Boolean indexing : returns true or false based on condition
print(player_age[player_age > 40])## fetching players more than age of 40
print(marks_series[marks_series > 16]) # fetching marks more than 16

4    41
6    48
9    41
Name: age, dtype: int64
maths      20
hindi      19
english    17
Name: marks_details, dtype: int64

**Editing items in series pandas**

In [47]:
marks_series.iloc[0] = 10 # modifying values of marks_series
print(marks_series)

maths      10
hindi      19
english    17
science    15
Name: marks_details, dtype: int64

In [48]:
daily_steps.iloc[1] = 10000

In [49]:
daily_steps

0     7500
1    10000
2     5000
3     6000
4     7500
5    10000
6     5000
7     9000
8     5000
9     5000
Name: Daily_Steps, dtype: int64

In [50]:
student_series
student_series['c'] = 'Mohit'
print(student_series)

a    Shravan
b     Akshay
c      Mohit
d      Sahil
Name: student_details, dtype: object

In [52]:
## using slicing to update values
countries_series.iloc[0:] = ['aidnI','ASU','ecnarF','anitnegrA','lizarB']
countries_series

0        aidnI
1          ASU
2       ecnarF
3    anitnegrA
4       lizarB
dtype: object

In [55]:
## using slicing to update values loc
marks_series.loc['hindi' : 'science'] = [20,15,20]
print(marks_series)

maths      10
hindi      20
english    15
science    20
Name: marks_details, dtype: int64

In [58]:
## Fancy indexing to update values
days_of_week = pd.Series(['Monday' , 'Tuesday' , 'Wednesday' , 'Thursday' , 'Friday' , 'Saturday' , 'Sunday'],index = ['a','b','c','d','e','f','g'])
days_of_week

a       Monday
b      Tuesday
c    Wednesday
d     Thursday
e       Friday
f     Saturday
g       Sunday
dtype: object

In [59]:
days_of_week.loc[['g','e' ,'d','b']] = ['day off' , 'Deployment' , 'QA session' , 'Coding and discussions']
print(days_of_week)

a                    Monday
b    Coding and discussions
c                 Wednesday
d                QA session
e                Deployment
f                  Saturday
g                   day off
dtype: object

**Series with python functionality**

In [63]:
## typeconversion
print(list(marks_series))
print(dict(marks_series))

[10, 20, 15, 20]
{'maths': np.int64(10), 'hindi': np.int64(20), 'english': np.int64(15), 'science': np.int64(20)}

In [69]:
## membership operations -> Uses the labels of the values
demo_series = pd.Series([1,2,3,4,5], index = ['a' , 'b' , 'c' ,'d' , 'e'])
print(demo_series)
'a' in demo_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

True

In [74]:
## Looping on the series
movies_data
for lead in movies_data.head(15).values:
  print(lead)

Vicky Kaushal
Vicky Ahuja
Anupam Kher
Emraan Hashmi
Mona Ambegaonkar
Geetika Vidya Ohlyan
Arshad Warsi
Radhika Apte
Kangana Ranaut
Nawazuddin Siddiqui
Ali Asgar
Ranveer Singh
Prit Kamani
Ajay Devgn
Sushant Singh Rajput

In [76]:
## Arithmetic operations on series data
100 - marks_series

maths      90
hindi      80
english    85
science    80
Name: marks_details, dtype: int64

In [77]:
## Relational operations
val_series = pd.Series([10,50,80,90,40,60])
val_series > 40

0    False
1     True
2     True
3     True
4    False
5     True
dtype: bool

In [95]:
## Find actors who have done more than 20 movies
actors = movies_data.value_counts()
print(actors[actors.values > 20].index)

Index(['Akshay Kumar', 'Amitabh Bachchan', 'Ajay Devgn', 'Salman Khan',
       'Sanjay Dutt', 'Shah Rukh Khan', 'Emraan Hashmi'],
      dtype='object', name='lead')

**Pandas Series Methods**